In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame()

In [10]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [24]:
df1 = pd.DataFrame([[1,2,3,4],[8,5,7,4],[10,7,9,60],[10,74,56,98]],columns = ['A','B','C','D'])

In [25]:
df1

    A   B   C   D
0   1   2   3   4
1   8   5   7   4
2  10   7   9  60
3  10  74  56  98

In [26]:
df1.head(2)

   A  B  C  D
0  1  2  3  4
1  8  5  7  4

In [27]:
df1.tail(2)

    A   B   C   D
2  10   7   9  60
3  10  74  56  98

In [28]:
df1.shape

(4, 4)

In [29]:
df1.iloc[0,1]

2

In [30]:
df1.iloc[0:2,0:2]

   A  B
0  1  2
1  8  5

In [31]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  5  7